Saas_3/build/web/WEB-INF/wsit-saas.dir.xml

<?xml version="1.0" encoding="UTF-8"?> 
 <definitions 
 xmlns="http://schemas.xmlsoap.org/wsdl/" 
 xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
 xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
 xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" name="dirService" targetNamespace="http://saas/" xmlns:tns="http://saas/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:fi="http://java.sun.com/xml/ns/wsit/2006/09/policy/fastinfoset/service" xmlns:tcp="http://java.sun.com/xml/ns/wsit/2006/09/policy/soaptcp/service" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrmp/200702" xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702" xmlns:sc="http://schemas.sun.com/2006/03/wss/server" xmlns:wspp="http://java.sun.com/xml/ns/wsit/policy"
 >
    <message name="Index"/>
    <message name="IndexResponse"/>
    <message name="Searching"/>
    <message name="SearchingResponse"/>
    <message name="readingFile"/>
    <message name="readingFileResponse"/>
    <message name="editFile"/>
    <message name="editFileResponse"/>
    <portType name="dir">
        <operation name="Index">
            <input message="tns:Index"/>
            <output message="tns:IndexResponse"/>
        </operation>
        <operation name="Searching">
            <input message="tns:Searching"/>
            <output message="tns:SearchingResponse"/>
        </operation>
        <operation name="readingFile">
            <input message="tns:readingFile"/>
            <output message="tns:readingFileResponse"/>
        </operation>
        <operation name="editFile">
            <input message="tns:editFile"/>
            <output message="tns:editFileResponse"/>
        </operation>
    </portType>
    <binding name="dirPortBinding" type="tns:dir">
        <operation name="Index">
            <input></input>
            <output></output>
        </operation>
        <operation name="Searching">
            <input></input>
            <output></output>
        </operation>
        <operation name="readingFile">
            <input></input>
            <output></output>
        </operation>
        <operation name="editFile">
            <input></input>
            <output></output>
        </operation>
    </binding>
    <service name="dirService">
        <port name="dirPort" binding="tns:dirPortBinding"/>
    </service>
</definitions>



