Saas_3/build/web/WEB-INF/classes/postingSoap/post.msg

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header/>
    <S:Body>
        <ns2:readingFile xmlns:ns2="http://saas/">
            <File>D:\search\stopwords_en.txt </File>
        </ns2:readingFile>
    </S:Body>
</S:Envelope>
