web/dirServicer.htm

<html><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8"><title>Method
 invocation trace</title></head><body><h2><a> readingFile </a> Method 
invocation</h2><br><hr><h4>Method parameter(s)</h4><table border="1"><tbody><tr><th>Type</th><th>Value</th></tr><tr><td>java.lang.String</td><td>C:\\LOKESH
 ROLLNO.txt</td></tr></tbody></table><hr><h4>Method returned</h4>java.lang.String
 : "<b>
************ 
 EC3126170
************
</b>"<hr><h4>SOAP Request</h4><hr><blockquote><pre xml:lang="">&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"&gt;
    &lt;S:Header/&gt;
    &lt;S:Body&gt;
        &lt;ns2:readingFile xmlns:ns2="http://saas/"&gt;
            &lt;File&gt;C:\\LOKESH ROLLNO.txt&lt;/File&gt;
        &lt;/ns2:readingFile&gt;
    &lt;/S:Body&gt;
&lt;/S:Envelope&gt;
</pre></blockquote><hr><h4>SOAP Response</h4><hr><blockquote><pre xml:lang="">&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"&gt;
    &lt;S:Body&gt;
        &lt;ns2:readingFileResponse xmlns:ns2="http://saas/"&gt;
            &lt;return&gt;
************ 
 EC3126170
************
&lt;/return&gt;
        &lt;/ns2:readingFileResponse&gt;
    &lt;/S:Body&gt;
&lt;/S:Envelope&gt;
</pre></blockquote><hr></body></html>